---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayNumSlices
source: html/6ee3f455-8493-980c-af38-6a6eb7ce0690.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodRayNumSlices Property

The property labeled "Number of slices in xy plane" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodRayNumSlices { get; }
```

## Remarks
This property is of type "AssetPropertyInteger".